In [1]:
import pandas as pd

In [2]:
file_path = '../dataset/auto-mpg.csv'
df = pd.read_csv(file_path, header=None)

df.head()

      0  1      2      3       4     5   6  7                          8
0  18.0  8  307.0  130.0  3504.0  12.0  70  1  chevrolet chevelle malibu
1  15.0  8  350.0  165.0  3693.0  11.5  70  1          buick skylark 320
2  18.0  8  318.0  150.0  3436.0  11.0  70  1         plymouth satellite
3  16.0  8  304.0  150.0  3433.0  12.0  70  1              amc rebel sst
4  17.0  8  302.0  140.0  3449.0  10.5  70  1                ford torino

# 컬럼명 부여

In [9]:
df.columns = ['mpg', 'cylinders','displacement','horsepower',
             'weight', 'aceleration','model year','origin','name']

In [3]:
print(df.head(3)); print()

print(df.tail(3)); print()

print(df.shape)                 # 행과 열의 갯수

      0  1      2      3       4     5   6  7                          8
0  18.0  8  307.0  130.0  3504.0  12.0  70  1  chevrolet chevelle malibu
1  15.0  8  350.0  165.0  3693.0  11.5  70  1          buick skylark 320
2  18.0  8  318.0  150.0  3436.0  11.0  70  1         plymouth satellite

        0  1      2      3       4     5   6  7              8
395  32.0  4  135.0  84.00  2295.0  11.6  82  1  dodge rampage
396  28.0  4  120.0  79.00  2625.0  18.6  82  1    ford ranger
397  31.0  4  119.0  82.00  2720.0  19.4  82  1     chevy s-10

(398, 9)

In [4]:
df.describe()             # 데이터 통계 요약 정보, NaN 데이터는 포함하지 않음.

,0,1,2,4,5,6,7
count,398.000000,398.000000,398.000000,398.000000,398.000000,398.000000,398.000000
mean,23.514573,5.454774,193.425879,2970.424623,15.568090,76.010050,1.572864
std,7.815984,1.701004,104.269838,846.841774,2.757689,3.697627,0.802055
min,9.000000,3.000000,68.000000,1613.000000,8.000000,70.000000,1.000000
25%,17.500000,4.000000,104.250000,2223.750000,13.825000,73.000000,1.000000
50%,23.000000,4.000000,148.500000,2803.500000,15.500000,76.000000,1.000000
75%,29.000000,8.000000,262.000000,3608.000000,17.175000,79.000000,2.000000
max,46.600000,8.000000,455.000000,5140.000000,24.800000,82.000000,3.000000

In [5]:
df.describe(include='all')     # include = 'all'로 인해 NaN 데이터 포함.

,0,1,2,3,4,5,6,7,8
count,398.000000,398.000000,398.000000,398,398.000000,398.000000,398.000000,398.000000,398
unique,NaN,NaN,NaN,94,NaN,NaN,NaN,NaN,305
top,NaN,NaN,NaN,150.0,NaN,NaN,NaN,NaN,ford pinto
freq,NaN,NaN,NaN,22,NaN,NaN,NaN,NaN,6
mean,23.514573,5.454774,193.425879,NaN,2970.424623,15.568090,76.010050,1.572864,NaN
std,7.815984,1.701004,104.269838,NaN,846.841774,2.757689,3.697627,0.802055,NaN
min,9.000000,3.000000,68.000000,NaN,1613.000000,8.000000,70.000000,1.000000,NaN
25%,17.500000,4.000000,104.250000,NaN,2223.750000,13.825000,73.000000,1.000000,NaN
50%,23.000000,4.000000,148.500000,NaN,2803.500000,15.500000,76.000000,1.000000,NaN
75%,29.000000,8.000000,262.000000,NaN,3608.000000,17.175000,79.000000,2.000000,NaN
max,46.600000,8.000000,455.000000,NaN,5140.000000,24.800000,82.000000,3.000000,NaN

In [7]:
df.count()            # 실제 데이터가 들어가있는(각 열의 유효한 자료) 
                      # 값의 갯수 ( 유효한 자료 = NaN이 제외된 자료 )

0    398
1    398
2    398
3    398
4    398
5    398
6    398
7    398
8    398
dtype: int64

In [10]:
df.mpg.count()        # mpg 컬럼의 유효한 자료의 갯수

398

# count() : 각 컬럼의 유효한 자료 갯수

In [12]:
import seaborn as sns
titanic = sns.load_dataset('titanic')

In [13]:
titanic.count()      # deck 부분에 유효한 자료가 별로 없음

survived       891
pclass         891
sex            891
age            714
sibsp          891
parch          891
fare           891
embarked       889
class          891
who            891
adult_male     891
deck           203
embark_town    889
alive          891
alone          891
dtype: int64

In [14]:
df_t = titanic.copy()

In [15]:
df_t.drop(columns='deck', axis=1, inplace=True)
df_t.count()                                      # deck 삭제

survived       891
pclass         891
sex            891
age            714
sibsp          891
parch          891
fare           891
embarked       889
class          891
who            891
adult_male     891
embark_town    889
alive          891
alone          891
dtype: int64

In [16]:
# 각 열의 고유한 값의 갯수:df.value_counts(), df[열명].value_counts()
# value 를 사용하면 유니크한 값이 나온다.

print(df.origin.value_counts())

df.value_counts()

1    249
3     79
2     70
Name: origin, dtype: int64

mpg   cylinders  displacement  horsepower  weight  aceleration  model year  origin  name
9.0   8          304.0         193.0       4732.0  18.5         70          1       hi 1200d                                1
27.0  4          151.0         90.00       2950.0  17.3         82          1       chevrolet camaro                        1
                 140.0         86.00       2790.0  15.6         82          1       ford mustang gl                         1
                 112.0         88.00       2640.0  18.6         82          1       chevrolet cavalier wagon                1
                 101.0         83.00       2202.0  15.3         76          2       renault 12tl                            1
                                                                                                                           ..
18.6  6          225.0         110.0       3620.0  18.7         78          1       dodge aspen                             1
18.5  8          360.0         150.0       3940.0  13.0         79          1       chrysler lebaron town @ country (sw)    1
      6          250.0         98.00       3525.0  19.0         77          1       ford granada                            1
                               110.0       3645.0  16.2         76          1       pontiac ventura sj                      1
46.6  4          86.0          65.00       2110.0  17.9         80          3       mazda glc                               1
Length: 398, dtype: int64

# 데이터프레임, 시리즈 모두 사용 가능한 기능 (mean, median, max, min, std, var, corr)

In [17]:
# 평균값 : mean()            

df.mean(numeric_only=True)        # ()안의 내용이 없으면 경고가 뜬다.

mpg               23.514573
cylinders          5.454774
displacement     193.425879
weight          2970.424623
aceleration       15.568090
model year        76.010050
origin             1.572864
dtype: float64

In [18]:
df[['mpg','weight','origin']].mean()  # 내가 보고싶은 자료만 뽑아서 볼 수 있다.

mpg         23.514573
weight    2970.424623
origin       1.572864
dtype: float64

In [19]:
# 중간값 : median()

df.median(numeric_only=True)

mpg               23.0
cylinders          4.0
displacement     148.5
weight          2803.5
aceleration       15.5
model year        76.0
origin             1.0
dtype: float64

In [20]:
df[['mpg','weight','origin']].median()

mpg         23.0
weight    2803.5
origin       1.0
dtype: float64

In [21]:
# 최대값 : max()
# 최소값 : min()
# 표준편차 : std()
# 분산 : var()
# 상관계수 : corr() ->  열 이름 리스트

df[['mpg','weight']].corr()

             mpg    weight
mpg     1.000000 -0.831741
weight -0.831741  1.000000

In [22]:
df_t.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,Southampton,no,True

In [23]:
# 가장 많은 나이  # age

df_t.age.max()

80.0

In [25]:
# 클래스별 승객 인원수   # class

df_t['class'].value_counts()      # class는 키워드이기 때문에 []로 사용

Third     491
First     216
Second    184
Name: class, dtype: int64

In [26]:
# 남자와 여자의 승객수   # sex

df_t.sex.value_counts()

male      577
female    314
Name: sex, dtype: int64

# loc 다음에 인덱스가 아닌 조건이 올 경우

In [27]:
# 전체의 평균 나이보다 적은 나이의 승객 정보를 출력
# age, class, sex 정보만 출력
# df_t.age.mean() 평균나이

df_mask = [ df_t.age < df_t.age.mean() ]
print(df_mask)

df_t.loc[ df_t.age < df_t.age.mean(), ['age', 'class', 'sex']]

         # 원래라면 loc 다음에 인덱스가 들어와야 하지만, 
        # 저장된 자료에 뽑아내고 싶은 조건이 있을 경우 이런 방식으로 작성
        # df.loc[조건, [출력하고 싶은 column]]

[0       True
1      False
2       True
3      False
4      False
       ...
886     True
887     True
888    False
889     True
890    False
Name: age, Length: 891, dtype: bool]

      age   class     sex
0    22.0   Third    male
2    26.0   Third  female
7     2.0   Third    male
8    27.0   Third  female
9    14.0  Second  female
..    ...     ...     ...
883  28.0  Second    male
884  25.0   Third    male
886  27.0  Second    male
887  19.0   First  female
889  26.0   First    male

[384 rows x 3 columns]